from Κατηγορίες import *
from Τονιστής import Τονιστής

class Γραμματική:
	def __init__(self):
		self.τονιστής = Τονιστής()
		
	def ουσιαστικά(self, λήμμα, κατηγορία, διάλεκτο="δημοτική"):
		if not (λήμμα and κατηγορία):
			return []
		λέξεις = []
		if λήμμα==None:
			return λέξεις
		if "-" in λήμμα:
			λήμμα = λήμμα.replace("-","")
		κκαταλήξεις, κτόνοι = κατηγορίες_ουσιαστικών[διάλεκτο][κατηγορία]
		υποκαταλήξεις = καταλήξεις_ονομάτων[διάλεκτο][κκαταλήξεις]
		ν=0
		for υποκατάληξη in υποκαταλήξεις:
			τόνος = τόνοι_ονομάτων[διάλεκτο][κτόνοι][ν]
			i=0
			λ = []
			for κατάληξη in υποκατάληξη:
				if not τόνος:
					continue
				νέα_λέξη = self.τονιστής.βάλε_τόνο(λήμμα+κατάληξη, τόνος[i])
				λ.append(νέα_λέξη)
				i+=1
			λέξεις.append(λ)	
			ν+=1
		return λέξεις
	
	def επίθετα(self, λήμμα, κατηγορία, διάλεκτο="δημοτική"):
		if not (λήμμα or κατηγορία):
			return []
		if "-" in λήμμα:
			λήμμα = λήμμα.replace("-","")
		λέξεις = []
		for γένοι in κατηγορίες_επιθέτων[διάλεκτο][κατηγορία]:
			υποκαταλήξεις = καταλήξεις_ονομάτων[διάλεκτο][γένοι[0]]
			τόνος = τόνοι_ονομάτων[διάλεκτο][γένοι[1]]
			λγένος = []
			i=0
			for υποκατάληξη in υποκαταλήξεις:
				λ = []
				ν = 0
				for κατάληξη in υποκατάληξη:
					if not τόνος[i] or ν+1>len(τόνος[i]):
						λ.append([])
						continue
					νέα_λέξη = self.τονιστής.βάλε_τόνο(λήμμα+κατάληξη, τόνος[i][ν])
					ν+=1
					λ.append(νέα_λέξη)
				i += 1
				λγένος.append(λ)
			λέξεις.append(λγένος)	
		return λέξεις

if __name__ == "__main__":
	from λήμματα import *
	γ = Γραμματική()
	for διάλεκτο, λήμματα2 in λήμματα.items():
		for λήμμα, κατηγορίες in λήμματα2.items():
			for κατηγορία in κατηγορίες:
				if κατηγορία["ΜτΛ"]=="ουσιαστικό":
					print(γ.ουσιαστικά(λήμμα, κατηγορία["κατηγορία"]))
				elif κατηγορία["ΜτΛ"]=="επίθετο":
					print(γ.επίθετα(λήμμα, κατηγορία["κατηγορία"]))
